#### SQLite in Python

In [1]:
import sqlite3

In [3]:
conn = sqlite3.connect('data/example.db')

In [4]:
c = conn.cursor()
c.execute('CREATE TABLE person(name text,address text)')
conn.commit()

OperationalError: table person already exists

In [7]:
c.execute("SELECT name FROM sqlite_master WHERE type='table'")
c.fetchall()

[('person',)]

In [12]:
c.execute("INSERT INTO person VALUES('Anna Henry','Carlow')")
conn.commit()

In [13]:
c.execute("SELECT * FROM person")
c.fetchall()

[('Anna Henry', 'Carlow'), ('Anna Henry', 'Carlow')]

In [14]:
person =[('Shelby Beck', 'Tipp'),('Geoff', 'Derby'),('Terry','London')]

In [15]:
person

[('Shelby Beck', 'Tipp'), ('Geoff', 'Derby'), ('Terry', 'London')]

In [16]:
c.executemany("INSERT INTO person VALUES (?,?)", person)
conn.commit()

In [17]:
c.execute("SELECT name FROM person")
c.fetchall()

[('Anna Henry',), ('Anna Henry',), ('Shelby Beck',), ('Geoff',), ('Terry',)]

In [19]:
c.execute("SELECT ROWID, name, address FROM person")
c.fetchall()

[(1, 'Anna Henry', 'Carlow'),
 (2, 'Anna Henry', 'Carlow'),
 (3, 'Shelby Beck', 'Tipp'),
 (4, 'Geoff', 'Derby'),
 (5, 'Terry', 'London')]

In [22]:
c.execute("DELETE FROM person WHERE ROWID=1")
conn.commit()

In [24]:
c.execute("SELECT ROWID, name, address FROM person")
c.fetchall()

[(2, 'Anna Henry', 'Carlow'),
 (3, 'Shelby Beck', 'Tipp'),
 (4, 'Geoff', 'Derby'),
 (5, 'Terry', 'London')]

In [26]:
c.execute("SELECT ROWID, name, address FROM person")
c.fetchall()

[(2, 'Anna Henry', 'Carlow'),
 (3, 'Shelby Beck', 'Tipp'),
 (4, 'Geoff', 'Derby'),
 (5, 'Terry', 'London')]

In [29]:
c.execute("INSERT INTO person VALUES('jumbo simpson','chunkyland')")
conn.commit()

In [30]:
c.execute("SELECT ROWID, name, address FROM person")
c.fetchall()

[(2, 'Anna Henry', 'Carlow'),
 (3, 'Shelby Beck', 'Tipp'),
 (4, 'Geoff', 'Derby'),
 (5, 'Terry', 'London'),
 (6, 'jumbo simpson', 'chunkyland'),
 (7, 'jumbo simpson', 'chunkyland'),
 (8, 'jumbo simpson', 'chunkyland')]

In [34]:
c.execute("DELETE FROM person WHERE ROWID=8")
conn.commit()
c.execute("DELETE FROM person WHERE ROWID=7")
conn.commit()

In [35]:
c.execute("SELECT ROWID, name, address FROM person")
c.fetchall()

[(2, 'Anna Henry', 'Carlow'),
 (3, 'Shelby Beck', 'Tipp'),
 (4, 'Geoff', 'Derby'),
 (5, 'Terry', 'London'),
 (6, 'jumbo simpson', 'chunkyland')]

In [5]:
c.execute("INSERT INTO person VALUES('jumbo simpson','chunkyland')")
conn.commit()

In [7]:
c.execute("SELECT ROWID, name, address FROM person")
c.fetchall()

[(2, 'Anna Henry', 'Carlow'),
 (3, 'Shelby Beck', 'Tipp'),
 (4, 'Geoff', 'Derby'),
 (5, 'Terry', 'London'),
 (6, 'jumbo simpson', 'chunkyland'),
 (7, 'jumbo simpson', 'chunkyland')]

In [10]:
import pandas as pd

In [8]:
c.execute("DELETE FROM person WHERE ROWID=6")
conn.commit()

In [9]:
c.execute("SELECT ROWID, name, address FROM person")
c.fetchall()

[(2, 'Anna Henry', 'Carlow'),
 (3, 'Shelby Beck', 'Tipp'),
 (4, 'Geoff', 'Derby'),
 (5, 'Terry', 'London'),
 (7, 'jumbo simpson', 'chunkyland')]

###### SQLite with Pandas

In [23]:
###c.execute ("Drop table person")

In [24]:
iris = pd.read_csv(r"C:\Users\user\Desktop\Matplotlib examples\iris flower.csv",header=None)
iris.head(10)

     0    1    2    3            4
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa
5  5.4  3.9  1.7  0.4  Iris-setosa
6  4.6  3.4  1.4  0.3  Iris-setosa
7  5.0  3.4  1.5  0.2  Iris-setosa
8  4.4  2.9  1.4  0.2  Iris-setosa
9  4.9  3.1  1.5  0.1  Iris-setosa

In [28]:
iris.to_sql("iris", conn)

ValueError: Table 'iris' already exists.

In [25]:
c.execute("SELECT * FROM person")
c.fetchall()

[('Anna Henry', 'Carlow'),
 ('Shelby Beck', 'Tipp'),
 ('Geoff', 'Derby'),
 ('Terry', 'London'),
 ('jumbo simpson', 'chunkyland')]